//=============================================================================
// タイトルUI：ロゴ操作処理 [control_ui_title_logo.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _CONTROL_UI_TITLE_LOGO_H_
#define _CONTROL_UI_TITLE_LOGO_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TITLE_LOGO_GRAVITY		(0.1f)	// 重力
#define TITLE_LOGO_RISE			(12.3f)	// 上昇量
#define TITLE_LOGO_RISE_SECOND	(3.1f)	// 2度目からの上昇量

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "control.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CControlUiTitleLogo : public CControl
{
public:
	CControlUiTitleLogo();					// コンストラクタ
	~CControlUiTitleLogo();					// デストラクタ
	HRESULT Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(CScene *pScene);			// 更新処理
	static CControlUiTitleLogo *Create();	// 生成処理

private:
	float m_fMaxMove;						// 移動量の最大値
	bool m_bOnce;							// 一度だけ行うための変数
};

#endif	//_CONTROL_UI_TITLE_LOGO_H_