//=============================================================================
// タイトルUI：エンター文字操作処理 [control_ui_title_enter.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _CONTROL_UI_TITLE_ENTER_H_
#define _CONTROL_UI_TITLE_ENTER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "control.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CControlUiTitleEnter : public CControl
{
public:
	CControlUiTitleEnter();						// コンストラクタ
	~CControlUiTitleEnter();					// デストラクタ
	HRESULT Init(void);							// 初期化処理
	void Uninit(void);							// 終了処理
	void Update(CScene *pScene);				// 更新処理
	static CControlUiTitleEnter *Create(void);	// 生成処理

private:
	int m_nCount;								// カウント
	D3DXCOLOR m_col;							// カラー
	bool m_bAlphaUp;							// アルファ度を上げるかどうか
};
#endif	//_CONTROL_UI_TITLE_ENTER_H_