//=============================================================================
// 入力処理 [input.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CInput
{
public:
	CInput();												// コンストラクタ
	virtual ~CInput();										// デストラクタ
	virtual HRESULT Init(HINSTANCE hInstance, HWND hWnd);	// 初期化処理
	virtual void Uninit(void);								// 終了処理
	virtual void Update(void) = 0;							// 更新処理

protected:
	LPDIRECTINPUTDEVICE8 m_pDevice;							// デバイス
	static LPDIRECTINPUT8 m_pInput;							// ダイレクトインプット
};
#endif  // _INPUT_H_