//=============================================================================
// キーボード入力処理 [keyboard.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _KEYBOARD_H_
#define _KEYBOARD_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "input.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_KEY_MAX (256) //キーの最大数

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CKeyboard : public CInput
{
public:
	CKeyboard();									// コンストラクタ
	~CKeyboard();									// デストラクタ
	HRESULT Init(HINSTANCE hInstance, HWND hWnd);	// 初期化処理
	void Uninit(void);								// 終了処理
	void Update(void);								// 更新処理
	bool GetPress(int nKey);						// 入力状態の取得処理(プレス)
	bool GetTrigger(int nKey);						// 入力状態の取得処理(トリガー)
	bool GetRelease(int nKey);						// 入力状態の取得処理(リリース)
	bool GetAnyKey(void);							// 全てのキーの入力状態の取得処理(トリガー)

private:
	BYTE m_aKeyState[NUM_KEY_MAX];					// キーの情報
	BYTE m_aKeyStateTrigger[NUM_KEY_MAX];			// キーの情報(トリガー)
	BYTE m_aKeyStateRelease[NUM_KEY_MAX];			// キーの状態(リリース)
};
#endif	// _KEYBOARD_H_