//=============================================================================
// モデルロード処理 [model_load.cpp]
// Author: 草刈 翔
//=============================================================================
//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "model_load.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FILE_MODEL "data/TEXT/model.txt"	// 読み込むファイル名

//=============================================================================
// コンストラクタ
//=============================================================================
CModelLoad::CModelLoad()
{
	// 変数のクリア
	int m_nMaxModel = 0;
	memset(&aModelName, NULL, sizeof(aModelName));
}

//=============================================================================
// デストラクタ
//=============================================================================
CModelLoad::~CModelLoad()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
void CModelLoad::Init(void)
{
	//ファイル読み込み
	char cString[256];
	FILE *pFile = NULL;

	pFile = fopen(FILE_MODEL, "r");

	int nCntModel = 0;

	if (pFile != NULL)
	{
		while (1)
		{
			fscanf(pFile, "%s", &cString[0]);

			if (strcmp(&cString[0], "NUM_MODEL") == 0)	// NUM_MODELの文字列
			{
				// モデルの最大数を取得
				fscanf(pFile, "%s", &cString[0]);
				fscanf(pFile, "%d", &m_nMaxModel);
			}

			if (strcmp(&cString[0], "MODEL_FILENAME") == 0) // MODEL_FILENAMEの文字列
			{
				// モデル名を読み込む
				fscanf(pFile, "%s", &cString[0]);
				fscanf(pFile, "%s", &cString[0]);
				strcpy(&aModelName[nCntModel][0], &cString[0]);

				nCntModel++;
			}

			if (strcmp(&cString[0], "END_SCRIPT") == 0) // END_SCRIPTの文字列
			{
				break;
			}
		}
		fclose(pFile);
	}
}

//=============================================================================
// 終了処理
//=============================================================================
void CModelLoad::Uninit(void)
{
	
}