//=============================================================================
// モデルロード処理 [model_load.h]
// Author : 草刈 翔
//=============================================================================
#ifndef _MODEL_LOAD_H_
#define _MODEL_LOAD_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_MODEL_TYPE (128)	// モデルの種類

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CModelLoad
{
public:
	CModelLoad();							// コンストラクタ
	~CModelLoad();							// デストラクタ
	void Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	char *GetModelName(int nModelType)
	{ return &aModelName[nModelType][0]; }	// モデルのファイル名取得処理

private:
	int m_nMaxModel;						// モデルの最大数
	char aModelName[MAX_MODEL_TYPE][128];	// モデル名
};
#endif // _MODEL_LOAD_H_