//=============================================================================
// テクスチャ管理 [texture.cpp]
// Author : 草刈 翔
//=============================================================================
#ifndef _TEXTURE_H_
#define _TEXTURE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TEXTURE_2D	(64)	// テクスチャの最大数
#define MAX_TEXTURE_3D	(32)	// テクスチャの最大数

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CTexture
{
public:
	CTexture();											// コンストラクタ
	~CTexture();										// デストラクタ
	void Init(void);									// 初期化処理
	void Uninit(void);									// 終了処理
	LPDIRECT3DTEXTURE9 GetTexture2D(int nTexture);		// テクスチャ取得処理
	LPDIRECT3DTEXTURE9 GetTexture3D(int nTexture);		// テクスチャ取得処理

private:
	int LoadTexture(LPDIRECT3DTEXTURE9 tex[]);			// テクスチャロード処理
	LPDIRECT3DTEXTURE9 m_apTexture2D[MAX_TEXTURE_2D];	// テクスチャのポインタ
	LPDIRECT3DTEXTURE9 m_apTexture3D[MAX_TEXTURE_3D];	// テクスチャのポインタ
	int m_nMaxTex2D;									// テクスチャの最大数
	int m_nMaxTex3D;									// テクスチャの最大数
};

#endif